TexasInstruments/mcupsdk-core/examples/drivers/epwm/epwm_diode_emulation/am261x-som/r5fss0-0_nortos/example.syscfg
icl_xbar1.$name      = "CONFIG_ICL_XBAR0";
icl_xbar1.xbarOutput = ["MDL1_OUTA"];

input_xbar1.$name      = "CONFIG_INPUT_XBAR0";
input_xbar1.xbarOutput = "GPIO43";

input_xbar2.$name      = "CONFIG_INPUT_XBAR1";
input_xbar2.instance   = "INPUT_XBAR_1";
input_xbar2.xbarOutput = "GPIO45";

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["EPWM0_INT"];

int_xbar2.$name      = "CONFIG_INT_XBAR1";
int_xbar2.xbarOutput = ["EPWM1_INT"];
int_xbar2.instance   = "INT_XBAR_1";

int_xbar3.$name      = "CONFIG_INT_XBAR2";
int_xbar3.xbarOutput = ["EPWM6_TZINT"];
int_xbar3.instance   = "INT_XBAR_2";

output_xbar1.$name                      = "CONFIG_OUTPUT_XBAR0";
output_xbar1.xbarOutput                 = ["EPWM4_SYNCOUT"];
output_xbar1.OUTPUTXBAR.$assign         = "OUTPUTXBAR13";
output_xbar1.OUTPUTXBAR.XBAROUT.$assign = "GPIO119";
output_xbar1.xbarConfig.$name           = "CONFIG_EPWM_SYNCOUT_XBAR0";

output_xbar2.$name                      = "CONFIG_OUTPUT_XBAR1";
output_xbar2.xbarOutput                 = ["DEL6_TRIP"];
output_xbar2.OUTPUTXBAR.$assign         = "OUTPUTXBAR14";
output_xbar2.OUTPUTXBAR.XBAROUT.$assign = "GPIO120";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$assign           = "GPIO43";
epwm1.EPWM.B.$assign           = "GPIO44";
epwm2.EPWM.A.$assign           = "GPIO45";
epwm3.EPWM.A.$assign           = "GPIO47";
epwm3.EPWM.B.$assign           = "GPIO48";
epwm4.EPWM.A.$assign           = "GPIO49";
epwm5.EPWM.A.$assign           = "GPIO51";
epwm6.EPWM.A.$assign           = "GPIO53";
epwm6.EPWM.B.$assign           = "GPIO54";
epwm7.EPWM.A.$assign           = "GPIO55";
epwm7.EPWM.B.$assign           = "GPIO56";
debug_log.uartLog.UART.$suggestSolution = "UART0";
